<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <title>Aide d'Ant Movie Catalog</title>
	<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
	<link rel="stylesheet" href="main.css" type="text/css" />
</head>
<body>
<p class="title">Informations d'un film</p>
<hr />
<p>Dans la fen&ecirc;tre principale vous pouvez entrer pas mal d'informations
  pour chacun des films :</p>
<ul>
  <li><b>Label du support :</b> Vous pouvez indiquer ici le num&eacute;ro du disque,
    de la cassette, le code-barre, un label, ou n'importe quoi d'autre</li>
  <li><b>Type de support :</b> Le support utilis&eacute; pour stocker le film (BR, DVD, CD, VHS, etc...)</li>
  <li><b>Origine :</b> O&ugrave;/Comment vous avez eu ce film</li>
  <li><b>Date d'ajout :</b> Date &agrave; laquelle le film a &eacute;t&eacute; ajout&eacute;
    &agrave; la liste</li>
  <li><b>Emprunt&eacute; par :</b> Nom de la personne qui a emprunt&eacute; le film</li>
  <li><b>Date vu :</b> Date &agrave; laquelle le film a &eacute;t&eacute; visionn&eacute; pour la dernière fois</li>
  <li><b>Ma note :</b> Avez-vous aim&eacute; le film ? Vous pouvez le dire ici</li>
  <li><b>Note :</b> Autre note de la presse ou des utilisateurs</li>
  <li><b>Titre original</b></li>
  <li><b>Titre traduit</b></li>
  <li><b>R&eacute;alisateur</b></li>
  <li><b>Producteur</b></li>
  <li><b>Sc&eacute;nariste</b></li>
  <li><b>Compositeur</b></li>
  <li><b>Acteurs</b></li>
  <li><b>Pays</b></li>
  <li><b>Ann&eacute;e</b></li>
  <li><b>Dur&eacute;e : Longueur du film, en minutes</b></li>
  <li><b>Cat&eacute;gorie</b></li>
  <li><b>Certification :</b> Public vis&eacute; / Age minimum conseillé pour regarder le film</li>
  <li><b>Adresse web :</b> Vous pouvez indiquer ici une adresse de site web en relation
    avec le film. Vous pouvez lancer le navigateur par d&eacute;faut pour ouvrir
    cette URL en cliquant sur le bouton à droite du champ</li>
  <li><b>Description</b></li>
  <li><b>Commentaires</b></li>
  <li><b>Chemin fichier :</b> Chemin du fichier vid&eacute;o (même fonctionnement que le champ Adresse web)</li>
  <li><b>Format vid&eacute;o :</b> Codec ou m&eacute;dia utilis&eacute; pour la vid&eacute;o</li>
  <li><b>D&eacute;bit vid&eacute;o :</b> D&eacute;bit de la vid&eacute;o en kilobits
    par seconde</li>
  <li><b>Format audio :</b> Codec ou m&eacute;dia utilis&eacute; pour l'audio</li>
  <li><b>D&eacute;bit audio :</b> D&eacute;bit de l'audio en kilobits par seconde</li>
  <li><b>R&eacute;solution :</b> Largeur et hauteur du film (ex. 640x480)</li>
  <li><b>Fr&eacute;quence :</b> Nombre d'images par seconde</li>
  <li><b>Taille des fichiers :</b> Taille en m&eacute;ga-octets du film. Il peut y avoir
    plusieurs fichiers (ex. 650+590 ou 1240)</li>
  <li><b>Nombre de disques :</b> Nombre de disques ou de cassettes</li>
  <li><b>Langues</b></li>
  <li><b>Sous-titres</b></li>
</ul>
<p>Toutes les listes d&eacute;roulantes stockent et r&eacute;cup&egrave;rent leurs
  valeurs du fichier XML où sont stockées les préférences. Vous pouvez les modifier
  dans la fenêtre des <a href="options_fr.html#dropdown">Options</a> dans la rubrique
  &quot;Listes déroulantes&quot;. Une option permet d'utiliser les valeurs du catalogue
  courant plutôt que les listes prédéfinies.</p>
<p>Il y a d'autres "champs" additionnels qui apparaissent dans certaines fenêtres :<p>
<ul>
  <li><b>Coché :</b> L'état des cases à cocher dans la liste principale ;
    elles peuvent être activées via les <a href="options_fr.html#movielist">Options</a> si vous ne les voyez pas</li>
  <li><b>Etiquette couleur :</b> Les étiquettes couleurs associées aux films dans la liste principale (case à cocher de couleur et/ou ligne de couleur) ;
    elles peuvent être activées via les <a href="options_fr.html#movielist">Options</a> si vous ne voyez aucune couleur (blanc par défaut)</li>
  <li><b>Titre formaté :</b> Titre utilisé dans la liste principale, qui peut combiner à la fois le titre original et le titre traduit par exemple ;
    consultez la page des <a href="options_fr.html#formattedtitle">Options</a> pour plus d'informations</li>
  <li><b>Etat de l'image:</b> Retourne l'état de l'image du film (stockée dans le catalogue, copiée, externe, ...)</li>
  <li><b>Nombre d'extras:</b> Retourne le nombre d'extras du film</li>
</ul>
</body>
</html>
